package Lesson2;

public class Less2Home3 {
    /*                              Задача 3:
Составьте программу, выводящую на экран квадраты чисел от 10 до 20 включительно. */
    public static void main(String[] args) {
        for (int i = 10; i <= 20; i++) {
            System.out.println("Квадрат " + i + " = " + i * i);
        }
    }
}
